scr/Catalogs/рсш_ПОТОК_ВнешниеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>рсш_ПОТОК_ВнешниеДанные</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.рсш_ПОТОК_ТипДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

scr/Catalogs/рсш_ПОТОК_ВнешниеДанные/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПолучитьМакет(Команда)
	мОписаниеОповещенияЗавершениеВыбораКаталога = Новый ОписаниеОповещения("ЗавершениеВыбораКаталога", ЭтаФорма);
	мДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	мДиалогВыбораКаталога.Показать(мОписаниеОповещенияЗавершениеВыбораКаталога);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораКаталога(пРезультат, пДополнительныеПараметры) Экспорт
	Если пРезультат <> Неопределено Тогда
		НачатьПолучениеФайлаССервера(, фАдресХранилища, пРезультат[0]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьМакет(Команда)
	мОписаниеОповещенияЗавершениеПомещенияФайлов = Новый ОписаниеОповещения("ОбработкаЗавершенияПомещенияФайлов", ЭтаФорма);
	НачатьПомещениеФайла(мОписаниеОповещенияЗавершениеПомещенияФайлов);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗавершенияПомещенияФайлов(пРезультат, пАдрес, пВыбранноеИмяФайла, пДополнительныеПараметры) Экспорт
	Если пРезультат <> Неопределено И пРезультат Тогда
		Объект.ИмяФайла = Сред(пВыбранноеИмяФайла, СтрНайти(пВыбранноеИмяФайла, "\", НаправлениеПоиска.СКонца) + 1);
		Объект.ДатаИзменения = ТекущаяДата();
		мДвоичныеДанные = ПолучитьИзВременногоХранилища(пАдрес);
		фАдресХранилища = ПоместитьВоВременноеХранилище(мДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мОбъект = РеквизитФормыВЗначение("Объект");
	мДанные = мОбъект.ХранилищеДанных.Получить();
	фАдресХранилища = ПоместитьВоВременноеХранилище(мДанные, ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(фАдресХранилища) Тогда
		ТекущийОбъект.ХранилищеДанных = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(фАдресХранилища), Новый СжатиеДанных(5));
	Иначе
		ТекущийОбъект.ХранилищеДанных = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчистить(Команда)
	фАдресХранилища = "";
	Объект.ИмяФайла = "";
	Объект.ДатаИзменения = ТекущаяДата();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьМакет(Команда)
	мОписаниеОповещенияЗавершениеРедактированияМакета = Новый ОписаниеОповещения("ЗавершениеРедактированияМакета", ЭтаФорма);
	мСтруктураДляФормыМакетаУпр = Новый Структура("ИмяДокумента, АдресВременногоХранилища", Объект.ИмяФайла, фАдресХранилища);
	ОткрытьФорму("ОбщаяФорма.ФормаМакетаУпр", мСтруктураДляФормыМакетаУпр, ЭтаФорма, , , , мОписаниеОповещенияЗавершениеРедактированияМакета, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеРедактированияМакета(пРезультат, пДополнительныеПараметры) Экспорт
	//из потока получим размер данных
	//мДвоичныеДанныеМакета = ПолучитьИзВременногоХранилища(фАдресХранилища);
	//мПотокВПамяти = мДвоичныеДанныеМакета.ОткрытьПотокДляЧтения();
	//ЭтаФорма[пДополнительныеПараметры.РеквизитКомментария] = "" + Объект.ИмяФайла + ";" + мПотокВПамяти.Размер() + " байт" + ";изменено " + ТекущаяДата();
	//мПотокВПамяти.Закрыть();
КонецПроцедуры
